#Область ПрограммныйИнтерфейс

Процедура ОповеститьОператораОНовыхСообщениях() экспорт
	Попытка
		НовыеСообщения =  C2D_ВзаимодействиеСChat2DeskВызовСервера.ПолучитьНовыеСообщения(ПользователиКлиентСервер.ТекущийПользователь());
		
		Форма = ПолучитьФорму("ОбщаяФорма.ЧатКлиент",,,"c2d");
		Если не Форма.вводДоступен() Тогда
			Если НовыеСообщения.Количество()=1 Тогда
				Сообщение = НовыеСообщения[0];
				ПроцедураОткрытияФормыВзаимодействий = Новый ОписаниеОповещения("ОткрытьФормуЧатКлиента", C2D_ВзаимодействиеСC2DКлиентСервер);
				ПоказатьОповещениеПользователя(Сообщение.ПредставлениеКлиента, ПроцедураОткрытияФормыВзаимодействий, Сообщение.Текст, ПолучитьИзВременногоХранилища(Сообщение.Аватар), СтатусОповещенияПользователя.Важное,);		
			ИначеЕсли НовыеСообщения.Количество()>1 Тогда	
				ПроцедураОткрытияФормыВзаимодействий = Новый ОписаниеОповещения("ОткрытьФормуЧатКлиента", C2D_ВзаимодействиеСC2DКлиентСервер);
				ПоказатьОповещениеПользователя("У вас "+НовыеСообщения.Количество()+" новых сообщений", ПроцедураОткрытияФормыВзаимодействий, "Перейти к просмотру...", БиблиотекаКартинок.c2d_РазделChat2Desk, СтатусОповещенияПользователя.Важное,);
			Иначе
				Возврат;	
			КонецЕсли; 
		КонецЕсли;	
		Оповестить("C2D_ОбновитьСписокЧатов");
	Исключение
	КонецПопытки;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти