
&НаКлиенте
Процедура ЗагрузитьДанныеПоДиалогам(Команда)
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбОбновлении", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, "Обнолвение данных по клиентам может занять длительное время. Продолжить?",РежимДиалогаВопрос.ОКОтмена, 60);

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросОбОбновлении(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если не РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		возврат;
	КонецЕсли; 
	ДлительнаяОперация = НачатьОбновлениеДиалоговВФоне();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	Оповещение = Новый ОписаниеОповещения("ПослеЗавершенияОбновленияДиалогов",ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияОбновленияДиалогов(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Функция НачатьОбновлениеДиалоговВФоне()
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьВФоне("РегистрыСведений.C2D_Диалоги.ОбновитьСписокДиалоговВФоне", , ПараметрыВыполнения);
КонецФункции
