////////////////////////////////////////////////////////////////////////////////
// КлиентСерверные процедуры взаимодействия  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс
Функция ПолучитьСсылкуЧата(id) Экспорт 
	АдресСервера = C2D_ВзаимодействиеСApiПовтИсп.СерверВебДоступа();
	Если АдресСервера = "" Тогда
		АдресСервера = СформироватьТехническоеСообщение();
	КонецЕсли; 
	Возврат АдресСервера+"/"+"chat/all?dialogID="+Формат(id,"ЧГ=0")+"&minifiedView=2";	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуЧатКлиента(ПараметрыФормы) экспорт
Форма = ПолучитьФорму("ОбщаяФорма.ЧатКлиент",,,"c2d");
Если Форма.Открыта() Тогда
	форма.Активизировать();
Иначе
	Форма.Открыть();
КонецЕсли; 
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	Функция СформироватьТехническоеСообщение()
		Возврат "<!DOCTYPE html>
|<html>
|    <head>
|        <title>Не удалось найти ссылку на веб-форму chat2desk</title>
|    </head>
|    <body>
|        <p>К сожалению, не удалось сформировать ссылку на чат. Обратитесь к администратору</p>
|    </body>
|</html>";	
	КонецФункции
	
#КонецОбласти