////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Функция ПолучитьНовыеСообщения(Пользователь) Экспорт
	МассивНовыхСообщений = новый Массив;
	НачатьТранзакцию();
	МассивID = РегистрыСведений.C2D_Операторы.НайтиIDПоСсылке(Пользователь);
	Попытка		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	C2D_Сообщения.Id КАК Id,
		               |	C2D_Сообщения.Текст КАК Текст,
		               |	C2D_Клиенты.Клиент КАК Клиент,
		               |	C2D_Клиенты.avatar КАК avatar,
		               |	C2D_Клиенты.name КАК name,
		               |	C2D_Клиенты.assigned_name КАК assigned_name,
		               |	C2D_Клиенты.phone КАК phone,
		               |	C2D_ОповещенияОператоров.Operator_id КАК Operator_id,
		               |	C2D_Клиенты.Представление КАК Представление,
		               |	C2D_Клиенты.ПолноеИмяТипаДанных КАК ПолноеИмяТипаДанных
		               |ИЗ
		               |	РегистрСведений.C2D_ОповещенияОператоров КАК C2D_ОповещенияОператоров
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.C2D_Сообщения КАК C2D_Сообщения
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.C2D_Диалоги КАК C2D_Диалоги
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.C2D_Клиенты КАК C2D_Клиенты
		               |				ПО (C2D_Клиенты.ID = C2D_Диалоги.client_id)
		               |			ПО (C2D_Диалоги.id = C2D_Сообщения.dialog_id)
		               |		ПО C2D_ОповещенияОператоров.IDСообщения = C2D_Сообщения.Id
		               |			И (C2D_ОповещенияОператоров.Operator_id В (&МассивID))
		               |			И (C2D_ОповещенияОператоров.Оповещен = ЛОЖЬ)";
		Запрос.УстановитьПараметр("МассивID", МассивID);
				
		Выборка = Запрос.Выполнить().Выгрузить();
		Для каждого Строка Из Выборка Цикл 
			Попытка
				СтруктураСообщения = Новый Структура("Текст, ПредставлениеКлиента");
				ЗаполнитьЗначенияСвойств(СтруктураСообщения, Строка);
				АдресАватара = ПоместитьВоВременноеХранилище(Новый Картинка(C2D_ВзаимодействиеСApiСлужебный.ПолучитьДвоичныеДанныеКартинки(Строка.avatar), Ложь)); 
				СтруктураСообщения.Вставить("Аватар", АдресАватара);
				СтруктураСообщения.Вставить("ПредставлениеКлиента", Строка.Представление);
				МассивНовыхСообщений.Добавить(СтруктураСообщения);
				РегистрыСведений.C2D_ОповещенияОператоров.СообщениеДоставлено(Строка.Id, Строка.Operator_id);
			Исключение
				//ОписаниеОшибки()
			КонецПопытки;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
	   ОтменитьТранзакцию();
	КонецПопытки;

	Возврат МассивНовыхСообщений;
	
КонецФункции

Функция C2D_НастройкаЗавершена() Экспорт
	Выборка = Справочники.C2D_Аккаунты.Выбрать();
	НАстройкаЗавершена = Выборка.Следующий() и выборка.НастройкаЗавершена;
	Возврат НАстройкаЗавершена; 	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти