
#Область ПрограммныйИнтерфейс
Функция c2d_add_webhook(Запрос)
	СтруктураВходящихПараметров = Новый Структура;
	//Получаем имя метода
	ИмяМетода  = Запрос.ПараметрыURL["ИмяМетода"];    
	СтруктураВходящихПараметров.Вставить("ИмяМетода",ИмяМетода); 
	
	//Получим тип запроса
	HTTPМетод = Запрос.HTTPМетод;
	СтруктураВходящихПараметров.Вставить("HTTPМетод", HTTPМетод);
	
	//Забираем параметры из запроса
	ПараметрыЗапроса = Новый Соответствие;
	Для каждого Параметр Из Запрос.ПараметрыЗапроса Цикл
        ПараметрыЗапроса.Вставить(Параметр.Ключ,Параметр.Значение);
    КонецЦикла;
	СтруктураВходящихПараметров.Вставить("ПараметрыЗапроса",ПараметрыЗапроса);
	
	//Забираем тело запроса
	ТелоЗапроса = C2D_ВзаимодействиеСApiСлужебный.ДесериализоватьJSON(Запрос.ПолучитьТелоКакСтроку());
	СтруктураВходящихПараметров.Вставить("ТелоЗапроса", ТелоЗапроса);
	
	СтруктураОтвет = ОбработатьВызов(СтруктураВходящихПараметров);
	
	//Создаем ответ с кодом состояния
	Ответ = Новый HTTPСервисОтвет(СтруктураОтвет.КодОтвета); 
	Ответ.УстановитьТелоИзСтроки(СтруктураОтвет.JsonОтвета,КодировкаТекста.UTF8);	
	
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	Возврат Ответ;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ОбработатьВызов(СтруктураВходящихПараметров)
	
	//Переправляем на нужный метод
	СтруктураОтвет = Справочники.C2D_WebHooks.ОбработатьВызов(СтруктураВходящихПараметров);

	Возврат СтруктураОтвет;	
	
КонецФункции
#КонецОбласти