////////////////////////////////////////////////////////////////////////////////
// Функции получения данных из Кэша
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс
// Функция - Получить хэш
//
// Параметры:
//  СтруктураПараметров	 - Структура - Исходные данные для запроса к апи.
// 
// Возвращаемое значение:
//  Строка -  уникальный хэш идентифицирующий соответствие сохраненное в кэш
//
Функция ПолучитьХэш(СтруктураПараметров) Экспорт
	Хэш = новый ХешированиеДанных(ХешФункция.SHA256);
	Хэш.Добавить(ЗначениеВСтрокуВнутр(СтруктураПараметров));
	Возврат Хэш.ХешСумма;
КонецФункции

Функция ПолучитьДвоичныеДанныеКартинки(Путь) Экспорт
	Возврат C2D_ВзаимодействиеСApiСлужебный.ПолучитьДвоичныеДанныеКартинки(Путь);	
КонецФункции
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти