
&НаСервере
Процедура ОпубликоватьВебхукНаСервере()
	Справочники.C2D_Аккаунты.ЗарегистрироватьВебхук(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОпубликоватьВебхук(Команда)
	Оповещение = Новый ОписаниеОповещения("ВопросСохраненияЗавершение", ЭтотОбъект);
	
	Если Модифицированность Тогда
		ТекстВопроса = НСтр("ru = 'Данные аккаунта были изменены, сохранить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена,, КодВозвратаДиалога.Да);
	Иначе
		ОпубликоватьВебхукНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросСохраненияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда		
		Модифицированность = Ложь;
		ЭтаФорма.Записать();
		ОпубликоватьВебхукНаСервере();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

КонецПроцедуры


&НаСервере
Процедура ПерезаполнитьКаналыНаСервере()
	Справочники.C2D_Channels.ПерезаполнитьКаналы(Объект.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура ПерезаполнитьКаналы(Команда)
	ПерезаполнитьКаналыНаСервере();
КонецПроцедуры

