#Если сервер или ВнешнееСоединение тогда
#Область ПрограммныйИнтерфейс
Функция СоздатьПолучитьТранспорт(ТранспортСтрокой, Канал) Экспорт
	Если не ТипЗнч(канал) = Тип("СправочникСсылка.C2D_Channels") Тогда
		Канал = Справочники.C2D_Channels.СоздатьПолучитьКанал(Канал);
	КонецЕсли; 
	СсылкаНаТранспорт = Справочники.C2D_Transports.НайтиПоНаименованию(ТранспортСтрокой,Истина,,Канал);
	Если не ЗначениеЗаполнено(СсылкаНаТранспорт) Тогда
		Транспорт = Справочники.C2D_Transports.СоздатьЭлемент();
		Транспорт.Наименование = ТранспортСтрокой;
		Транспорт.Владелец = Канал;
		Транспорт.Записать();
		СсылкаНаТранспорт = Транспорт.Ссылка;
	КонецЕсли; 
	Возврат СсылкаНаТранспорт;	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Владелец = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Данные.ссылка, "Владелец");
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '(%1) %2'"), владелец, Данные.Наименование);
 	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
#КонецЕсли