#Если сервер или ВнешнееСоединение тогда
#Область ПрограммныйИнтерфейс
Процедура ПерезаполнитьКаналы(Аккаунт) Экспорт
	СоответствиеОтвет = C2D_ВзаимодействиеСApi.GET_channels();
	Если СоответствиеОтвет.Получить("status") = "success" Тогда
		ПерезаполнитьДанныеКаналов(СоответствиеОтвет.получить("data"), Аккаунт);
	ИначеЕсли СоответствиеОтвет.Получить("status") = "error" тогда
		Сообщение = Новый СообщениеПользователю;  			
		Сообщение.Текст = C2D_ВзаимодействиеСApiСлужебный.СформироватьТекстОшибки(СоответствиеОтвет);
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОсновнойТранспортДляАккаунта() экспорт
	СтруктураТранспорта = новый структура;
	Запрос = новый запрос;
	Запрос.текст = "ВЫБРАТЬ
	               |	C2D_Channelstransports.transport КАК transport,
	               |	C2D_Channelstransports.Ссылка.ChannelId КАК ChannelId
	               |ИЗ
	               |	Справочник.C2D_Channels.transports КАК C2D_Channelstransports
	               |ГДЕ
	               |	C2D_Channelstransports.Основной = ИСТИНА";
	выборка = Запрос.выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		СтруктураТранспорта = новый Структура("ChannelId, transport", Выборка.ChannelId, Выборка.transport);
	КонецЕсли; 
	Возврат структураТранспорта;	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ПерезаполнитьДанныеКаналов(МассивКаналов, Аккаунт)
	
	Для каждого СоответствиеКанал Из МассивКаналов Цикл
		 Канал = СоздатьПолучитьКанал(СоответствиеКанал, Аккаунт);
		 
		 Для каждого Транспорт Из СоответствиеКанал.получить("transports") Цикл
			 Справочники.C2D_Transports.СоздатьПолучитьТранспорт(транспорт, Канал);
		 КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

Функция СоздатьПолучитьКанал(IdКанала, Аккаунт = неопределено) Экспорт
	Если ТипЗнч(IdКанала) = тип("Соответствие") Тогда
		idКанала = IdКанала.Получить("id");
	иначе
		idКанала = IdКанала;
	КонецЕсли; 
	 
	Если аккаунт = неопределено Тогда
		аккаунт = Справочники.C2D_Аккаунты.ПолучитьАккаунтПоУмолчанию();
	КонецЕсли; 
	
	СсылкаНаКанал = справочники.C2D_Channels.НайтиПоРеквизиту("ChannelId", idКанала); 
	Если не ЗначениеЗаполнено(СсылкаНаКанал) Тогда
		Канал = Справочники.C2D_Channels.СоздатьЭлемент();
		Канал.ChannelId = idКанала;
		Канал.Наименование = IdКанала.Получить("name");
		Канал.владелец = Аккаунт;
		Канал.Записать();
		СсылкаНаКанал = Канал.Ссылка;
	КонецЕсли; 
	Возврат СсылкаНаКанал;	
КонецФункции

#КонецОбласти
#КонецЕсли